from textwrap import dedent

AUTH_REQUIRED = "Потрібна авторизація"
AUTHENTICATE = "Авторизуватися"
DENIED = "Відмова"
ACTION = "Оберіть дію"
CREATE_RECEIPT = "Створити чек"
PRINT = "Друк"
PRINTING = "Друкую…"
SELECT_GOOD = "Оберіть позицію"

_RECEIPT = dedent(
    """\
          ТІШИНА ОЛЕНА ЮРІЇВНА      
                Психолог            
    ДОНЕЦЬКА ОБЛ., М. КРАМАТОРСЬК,  
    вул. Василя Стуса, буд. 45,     
    офіс № 207                      
             ІД 3087923568          
      Касир: ТІШИНА ОЛЕНА ЮРІЇВНА   
      Відд.: ТІШИНА ОЛЕНА ЮРІЇВНА   
                                    
    1.000 x 200.00                  
    Консультація             200.00 
    --------------------------------
    Сума                      200.00
    Готівка                   200.00
    Валюта                       Грн
    --------------------------------
                                    
           Чек № LOoDMbHMCd8        
    13.01.2021              16:47:48
                 ОНЛАЙН             
    ФН ПРРО               4000058209
    ФІСКАЛЬНИЙ ЧЕК          CHECKBOX
    """
)
